; domain
(define (domain transport-strips)
(:requirements :typing :action-costs)

(:types location fuellevel locatable - object 
	package truck - locatable
)

(:predicates 
(connected ?l1 ?l2 - location)
(at ?o - locatable ?l - location)
(in ?p - package ?t - truck)
(fuel ?t - truck ?level - fuellevel)
(fuelcost ?level - fuellevel ?l1 ?l2 - location)
(sum ?a ?b ?c - fuellevel)
)

(:functions 
(total-cost) - number)

(:action LOAD
:parameters
(?p - package
?t - truck
?l - location)
:precondition
(and (at ?t ?l) (at ?p ?l))
:effect
(and (not (at ?p ?l)) (in ?p ?t) (increase (total-cost) 1))
)

(:action UNLOAD
:parameters
(?p - package
?t - truck
?l - location)
:precondition
(and (at ?t ?l) (in ?p ?t))
:effect
(and (at ?p ?l) (not (in ?p ?t)) (increase (total-cost) 1))
)

(:action DRIVE
:parameters
(?t - truck
?l1 - location
?l2 - location
?fuelpost - fuellevel
?fueldelta - fuellevel
?fuelpre - fuellevel)
:precondition
(and 
(connected ?l1 ?l2)
(fuelcost ?fueldelta ?l1 ?l2)
(fuel ?t ?fuelpre)
(sum ?fuelpost ?fueldelta ?fuelpre)
(at ?t ?l1)
)
:effect
(and (not (at ?t ?l1)) 
     (at ?t ?l2) 
     (not (fuel ?t ?fuelpre)) 
     (fuel ?t ?fuelpost)
     (increase (total-cost) 1))
)

)

; problem
(define (problem transport-l3-t1-p13---int100n150-m25---int100c110---s210---e0)
(:domain transport-strips)

(:objects
l0 l1 l2 - location
t0 - truck
p0 p1 p2 p3 p4 p5 p6 p7 p8 p9 p10 p11 p12 - package
level0 level1 level2 level3 level4 level5 level6 level7 level8 level9 level10 level11 level12 level13 level14 level15 level16 level17 level18 level19 level20 level21 level22 level23 level24 level25 - fuellevel
)

(:init
(sum level0 level1 level1)
(sum level0 level3 level3)
(sum level0 level15 level15)
(sum level1 level1 level2)
(sum level1 level3 level4)
(sum level1 level15 level16)
(sum level2 level1 level3)
(sum level2 level3 level5)
(sum level2 level15 level17)
(sum level3 level1 level4)
(sum level3 level3 level6)
(sum level3 level15 level18)
(sum level4 level1 level5)
(sum level4 level3 level7)
(sum level4 level15 level19)
(sum level5 level1 level6)
(sum level5 level3 level8)
(sum level5 level15 level20)
(sum level6 level1 level7)
(sum level6 level3 level9)
(sum level6 level15 level21)
(sum level7 level1 level8)
(sum level7 level3 level10)
(sum level7 level15 level22)
(sum level8 level1 level9)
(sum level8 level3 level11)
(sum level8 level15 level23)
(sum level9 level1 level10)
(sum level9 level3 level12)
(sum level9 level15 level24)
(sum level10 level1 level11)
(sum level10 level3 level13)
(sum level10 level15 level25)
(sum level11 level1 level12)
(sum level11 level3 level14)
(sum level12 level1 level13)
(sum level12 level3 level15)
(sum level13 level1 level14)
(sum level13 level3 level16)
(sum level14 level1 level15)
(sum level14 level3 level17)
(sum level15 level1 level16)
(sum level15 level3 level18)
(sum level16 level1 level17)
(sum level16 level3 level19)
(sum level17 level1 level18)
(sum level17 level3 level20)
(sum level18 level1 level19)
(sum level18 level3 level21)
(sum level19 level1 level20)
(sum level19 level3 level22)
(sum level20 level1 level21)
(sum level20 level3 level23)
(sum level21 level1 level22)
(sum level21 level3 level24)
(sum level22 level1 level23)
(sum level22 level3 level25)
(sum level23 level1 level24)
(sum level24 level1 level25)

(connected l0 l1)
(fuelcost level1 l0 l1)
(connected l0 l2)
(fuelcost level3 l0 l2)
(connected l1 l0)
(fuelcost level1 l1 l0)
(connected l1 l2)
(fuelcost level15 l1 l2)
(connected l2 l0)
(fuelcost level3 l2 l0)
(connected l2 l1)
(fuelcost level15 l2 l1)

(at t0 l0)
(fuel t0 level9)
(= (total-cost) 0)

(at p0 l0)
(at p1 l2)
(at p2 l2)
(at p3 l2)
(at p4 l1)
(at p5 l2)
(at p6 l1)
(at p7 l1)
(at p8 l1)
(at p9 l0)
(at p10 l2)
(at p11 l1)
(at p12 l0)
)

(:goal
(and
(at p0 l2)
(at p1 l1)
(at p2 l1)
(at p3 l0)
(at p4 l2)
(at p5 l0)
(at p6 l2)
(at p7 l2)
(at p8 l0)
(at p9 l1)
(at p10 l0)
(at p11 l0)
(at p12 l1)
)
)
(:metric minimize (total-cost)))

; plan
1. (load p9 t0 l0)
   deleted: (at p9 l0)
   added: (in p9 t0)
   goals met: 0 of 13
2. (load p12 t0 l0)
   deleted: (at p12 l0)
   added: (in p12 t0)
   goals met: 0 of 13
3. (drive t0 l0 l1 level8 level1 level9)
   deleted: (at t0 l0) (fuel t0 level9)
   added: (at t0 l1) (fuel t0 level8)
   goals met: 0 of 13
4. (unload p9 t0 l1)
   deleted: (in p9 t0)
   added: (at p9 l1)
   goals met: 1 of 13
5. (unload p12 t0 l1)
   deleted: (in p12 t0)
   added: (at p12 l1)
   goals met: 2 of 13
6. (load p8 t0 l1)
   deleted: (at p8 l1)
   added: (in p8 t0)
   goals met: 2 of 13
7. (load p7 t0 l1)
   deleted: (at p7 l1)
   added: (in p7 t0)
   goals met: 2 of 13
8. (load p6 t0 l1)
   deleted: (at p6 l1)
   added: (in p6 t0)
   goals met: 2 of 13
9. (load p4 t0 l1)
   deleted: (at p4 l1)
   added: (in p4 t0)
   goals met: 2 of 13
10. (load p11 t0 l1)
   deleted: (at p11 l1)
   added: (in p11 t0)
   goals met: 2 of 13
11. (drive t0 l1 l0 level7 level1 level8)
   deleted: (at t0 l1) (fuel t0 level8)
   added: (at t0 l0) (fuel t0 level7)
   goals met: 2 of 13
12. (unload p8 t0 l0)
   deleted: (in p8 t0)
   added: (at p8 l0)
   goals met: 3 of 13
13. (unload p11 t0 l0)
   deleted: (in p11 t0)
   added: (at p11 l0)
   goals met: 4 of 13
14. (load p0 t0 l0)
   deleted: (at p0 l0)
   added: (in p0 t0)
   goals met: 4 of 13
15. (drive t0 l0 l2 level4 level3 level7)
   deleted: (at t0 l0) (fuel t0 level7)
   added: (at t0 l2) (fuel t0 level4)
   goals met: 4 of 13
16. (unload p7 t0 l2)
   deleted: (in p7 t0)
   added: (at p7 l2)
   goals met: 5 of 13
17. (unload p6 t0 l2)
   deleted: (in p6 t0)
   added: (at p6 l2)
   goals met: 6 of 13
18. (unload p4 t0 l2)
   deleted: (in p4 t0)
   added: (at p4 l2)
   goals met: 7 of 13
19. (unload p0 t0 l2)
   deleted: (in p0 t0)
   added: (at p0 l2)
   goals met: 8 of 13
20. (load p5 t0 l2)
   deleted: (at p5 l2)
   added: (in p5 t0)
   goals met: 8 of 13
21. (load p3 t0 l2)
   deleted: (at p3 l2)
   added: (in p3 t0)
   goals met: 8 of 13
22. (load p2 t0 l2)
   deleted: (at p2 l2)
   added: (in p2 t0)
   goals met: 8 of 13
23. (load p10 t0 l2)
   deleted: (at p10 l2)
   added: (in p10 t0)
   goals met: 8 of 13
24. (load p1 t0 l2)
   deleted: (at p1 l2)
   added: (in p1 t0)
   goals met: 8 of 13
25. (drive t0 l2 l0 level1 level3 level4)
   deleted: (at t0 l2) (fuel t0 level4)
   added: (at t0 l0) (fuel t0 level1)
   goals met: 8 of 13
26. (unload p10 t0 l0)
   deleted: (in p10 t0)
   added: (at p10 l0)
   goals met: 9 of 13
27. (unload p3 t0 l0)
   deleted: (in p3 t0)
   added: (at p3 l0)
   goals met: 10 of 13
28. (unload p5 t0 l0)
   deleted: (in p5 t0)
   added: (at p5 l0)
   goals met: 11 of 13
29. (drive t0 l0 l1 level0 level1 level1)
   deleted: (at t0 l0) (fuel t0 level1)
   added: (at t0 l1) (fuel t0 level0)
   goals met: 11 of 13
30. (unload p1 t0 l1)
   deleted: (in p1 t0)
   added: (at p1 l1)
   goals met: 12 of 13
31. (unload p2 t0 l1)
   deleted: (in p2 t0)
   added: (at p2 l1)
   goals met: 13 of 13
